nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA176/iar/startup_MCXA176.s
        PUBWEAK LPTMR0_IRQHandler
        PUBWEAK LPTMR0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPTMR0_IRQHandler
        LDR     R0, =LPTMR0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved72_IRQHandler
        PUBWEAK Reserved72_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved72_IRQHandler
        LDR     R0, =Reserved72_DriverIRQHandler
        BX      R0

        PUBWEAK OS_EVENT_IRQHandler
        PUBWEAK OS_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
OS_EVENT_IRQHandler
        LDR     R0, =OS_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK WAKETIMER0_IRQHandler
        PUBWEAK WAKETIMER0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WAKETIMER0_IRQHandler
        LDR     R0, =WAKETIMER0_DriverIRQHandler
        BX      R0

        PUBWEAK UTICK0_IRQHandler
        PUBWEAK UTICK0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
UTICK0_IRQHandler
        LDR     R0, =UTICK0_DriverIRQHandler
        BX      R0

        PUBWEAK WWDT0_IRQHandler
        PUBWEAK WWDT0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WWDT0_IRQHandler
        LDR     R0, =WWDT0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved77_IRQHandler
        PUBWEAK Reserved77_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved77_IRQHandler
        LDR     R0, =Reserved77_DriverIRQHandler
        BX      R0

        PUBWEAK ADC0_IRQHandler
        PUBWEAK ADC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC0_IRQHandler
        LDR     R0, =ADC0_DriverIRQHandler
        BX      R0

        PUBWEAK ADC1_IRQHandler
        PUBWEAK ADC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC1_IRQHandler
        LDR     R0, =ADC1_DriverIRQHandler
        BX      R0

        PUBWEAK CMP0_IRQHandler
        PUBWEAK CMP0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CMP0_IRQHandler
        LDR     R0, =CMP0_DriverIRQHandler
        BX      R0

        PUBWEAK CMP1_IRQHandler
        PUBWEAK CMP1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CMP1_IRQHandler
        LDR     R0, =CMP1_DriverIRQHandler
        BX      R0

        PUBWEAK CMP2_IRQHandler
        PUBWEAK CMP2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CMP2_IRQHandler
        LDR     R0, =CMP2_DriverIRQHandler
        BX      R0

        PUBWEAK DAC0_IRQHandler
        PUBWEAK DAC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DAC0_IRQHandler
        LDR     R0, =DAC0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved84_IRQHandler
        PUBWEAK Reserved84_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved84_IRQHandler
        LDR     R0, =Reserved84_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved85_IRQHandler
        PUBWEAK Reserved85_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved85_IRQHandler
        LDR     R0, =Reserved85_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved86_IRQHandler
        PUBWEAK Reserved86_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved86_IRQHandler
        LDR     R0, =Reserved86_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO0_IRQHandler
        PUBWEAK GPIO0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO0_IRQHandler
        LDR     R0, =GPIO0_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO1_IRQHandler
        PUBWEAK GPIO1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO1_IRQHandler
        LDR     R0, =GPIO1_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO2_IRQHandler
        PUBWEAK GPIO2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO2_IRQHandler
        LDR     R0, =GPIO2_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO3_IRQHandler
        PUBWEAK GPIO3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO3_IRQHandler
        LDR     R0, =GPIO3_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO4_IRQHandler
        PUBWEAK GPIO4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO4_IRQHandler
        LDR     R0, =GPIO4_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved92_IRQHandler
        PUBWEAK Reserved92_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved92_IRQHandler
        LDR     R0, =Reserved92_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C2_IRQHandler
        PUBWEAK LPI2C2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C2_IRQHandler
        LDR     R0, =LPI2C2_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C3_IRQHandler
        PUBWEAK LPI2C3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C3_IRQHandler
        LDR     R0, =LPI2C3_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_RELOAD_ERROR_IRQHandler
        PUBWEAK FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_RELOAD_ERROR_IRQHandler
        LDR     R0, =FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_FAULT_IRQHandler
        PUBWEAK FLEXPWM1_FAULT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_FAULT_IRQHandler
        LDR     R0, =FLEXPWM1_FAULT_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_SUBMODULE0_IRQHandler
        PUBWEAK FLEXPWM1_SUBMODULE0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_SUBMODULE0_IRQHandler
        LDR     R0, =FLEXPWM1_SUBMODULE0_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_SUBMODULE1_IRQHandler
        PUBWEAK FLEXPWM1_SUBMODULE1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_SUBMODULE1_IRQHandler
        LDR     R0, =FLEXPWM1_SUBMODULE1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_SUBMODULE2_IRQHandler
        PUBWEAK FLEXPWM1_SUBMODULE2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_SUBMODULE2_IRQHandler
        LDR     R0, =FLEXPWM1_SUBMODULE2_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_SUBMODULE3_IRQHandler
        PUBWEAK FLEXPWM1_SUBMODULE3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_SUBMODULE3_IRQHandler
        LDR     R0, =FLEXPWM1_SUBMODULE3_DriverIRQHandler
        BX      R0

        PUBWEAK EQDC1_COMPARE_IRQHandler
        PUBWEAK EQDC1_COMPARE_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EQDC1_COMPARE_IRQHandler
        LDR     R0, =EQDC1_COMPARE_DriverIRQHandler
        BX      R0

        PUBWEAK EQDC1_HOME_IRQHandler
        PUBWEAK EQDC1_HOME_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EQDC1_HOME_IRQHandler
        LDR     R0, =EQDC1_HOME_DriverIRQHandler
        BX      R0

        PUBWEAK EQDC1_WATCHDOG_IRQHandler
        PUBWEAK EQDC1_WATCHDOG_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EQDC1_WATCHDOG_IRQHandler
        LDR     R0, =EQDC1_WATCHDOG_DriverIRQHandler
        BX      R0

        PUBWEAK EQDC1_INDEX_IRQHandler
        PUBWEAK EQDC1_INDEX_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EQDC1_INDEX_IRQHandler
        LDR     R0, =EQDC1_INDEX_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved105_IRQHandler
        PUBWEAK Reserved105_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved105_IRQHandler
        LDR     R0, =Reserved105_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved106_IRQHandler
        PUBWEAK Reserved106_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved106_IRQHandler
        LDR     R0, =Reserved106_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved107_IRQHandler
        PUBWEAK Reserved107_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved107_IRQHandler
        LDR     R0, =Reserved107_DriverIRQHandler
        BX      R0

