nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA176/iar/startup_MCXA176.s
        PUBWEAK Reserved108_IRQHandler
        PUBWEAK Reserved108_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved108_IRQHandler
        LDR     R0, =Reserved108_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved109_IRQHandler
        PUBWEAK Reserved109_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved109_IRQHandler
        LDR     R0, =Reserved109_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved110_IRQHandler
        PUBWEAK Reserved110_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved110_IRQHandler
        LDR     R0, =Reserved110_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART5_IRQHandler
        PUBWEAK LPUART5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART5_IRQHandler
        LDR     R0, =LPUART5_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved112_IRQHandler
        PUBWEAK Reserved112_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved112_IRQHandler
        LDR     R0, =Reserved112_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved113_IRQHandler
        PUBWEAK Reserved113_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved113_IRQHandler
        LDR     R0, =Reserved113_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved114_IRQHandler
        PUBWEAK Reserved114_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved114_IRQHandler
        LDR     R0, =Reserved114_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved115_IRQHandler
        PUBWEAK Reserved115_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved115_IRQHandler
        LDR     R0, =Reserved115_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved116_IRQHandler
        PUBWEAK Reserved116_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved116_IRQHandler
        LDR     R0, =Reserved116_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved117_IRQHandler
        PUBWEAK Reserved117_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved117_IRQHandler
        LDR     R0, =Reserved117_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved118_IRQHandler
        PUBWEAK Reserved118_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved118_IRQHandler
        LDR     R0, =Reserved118_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved119_IRQHandler
        PUBWEAK Reserved119_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved119_IRQHandler
        LDR     R0, =Reserved119_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved120_IRQHandler
        PUBWEAK Reserved120_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved120_IRQHandler
        LDR     R0, =Reserved120_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved121_IRQHandler
        PUBWEAK Reserved121_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved121_IRQHandler
        LDR     R0, =Reserved121_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved122_IRQHandler
        PUBWEAK Reserved122_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved122_IRQHandler
        LDR     R0, =Reserved122_DriverIRQHandler
        BX      R0

        PUBWEAK MAU_IRQHandler
        PUBWEAK MAU_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MAU_IRQHandler
        LDR     R0, =MAU_DriverIRQHandler
        BX      R0

        PUBWEAK SMARTDMA_IRQHandler
        PUBWEAK SMARTDMA_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SMARTDMA_IRQHandler
        LDR     R0, =SMARTDMA_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved125_IRQHandler
        PUBWEAK Reserved125_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved125_IRQHandler
        LDR     R0, =Reserved125_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved126_IRQHandler
        PUBWEAK Reserved126_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved126_IRQHandler
        LDR     R0, =Reserved126_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved127_IRQHandler
        PUBWEAK Reserved127_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved127_IRQHandler
        LDR     R0, =Reserved127_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved128_IRQHandler
        PUBWEAK Reserved128_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved128_IRQHandler
        LDR     R0, =Reserved128_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved129_IRQHandler
        PUBWEAK Reserved129_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved129_IRQHandler
        LDR     R0, =Reserved129_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved130_IRQHandler
        PUBWEAK Reserved130_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved130_IRQHandler
        LDR     R0, =Reserved130_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved131_IRQHandler
        PUBWEAK Reserved131_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved131_IRQHandler
        LDR     R0, =Reserved131_DriverIRQHandler
        BX      R0

        PUBWEAK ADC2_IRQHandler
        PUBWEAK ADC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC2_IRQHandler
        LDR     R0, =ADC2_DriverIRQHandler
        BX      R0

        PUBWEAK ADC3_IRQHandler
        PUBWEAK ADC3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC3_IRQHandler
        LDR     R0, =ADC3_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved134_IRQHandler
        PUBWEAK Reserved134_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved134_IRQHandler
        LDR     R0, =Reserved134_DriverIRQHandler
        BX      R0

        PUBWEAK RTC_IRQHandler
        PUBWEAK RTC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC_IRQHandler
        LDR     R0, =RTC_DriverIRQHandler
        BX      R0

        PUBWEAK RTC_1HZ_IRQHandler
        PUBWEAK RTC_1HZ_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC_1HZ_IRQHandler
        LDR     R0, =RTC_1HZ_DriverIRQHandler
        BX      R0

